-- NOTICE
--   Copyright 2019 bySHIFT
--   All rights reserved

-- ############################################################################
-- init_tbl_options
-- zer 数据库 应用相关设定表的初始化
-- ############################################################################

USE zer;

-- ############################################################################
-- init_tbl_options: 应用相关设定表的初始化
-- ############################################################################

-- 清理应用相关设定表的信息
TRUNCATE TABLE tbl_options;

-- ############################################################################
-- 注意
-- ############################################################################
INSERT INTO tbl_options
  SET code = '896AF3EA-5AD5-11E9-BC87-0242AC120004'
  , value = '谨慎修正!!!'
  , comment = '注意:
  1) code 字段不能修正, 此值是外部应用的依赖键;
  2) 设定相关配置选项时, 请按照说明进行相关设定, 特别注意一些半角符号;
  '
;

-- ############################################################################
-- 业务系统应用数据库的版本情报
-- ############################################################################
INSERT INTO tbl_options
  SET code = '38D4F118-5A8F-11E9-BC87-0242AC120004' -- 固定, 勿修正
  , value = '19.04.1001'
  , comment = '业务系统应用数据库的版本
  设定格式: Z9.Z9.ZZZZZ9'
;

-- ############################################################################
-- OCCBOOL 算量用 MQ 消息的相关情报
-- ############################################################################
-- 请求用
INSERT INTO tbl_options
  SET code = 'CDF8D384-5A94-11E9-BC87-0242AC120004' -- 固定, 勿修正
  , value = 'guest:guest@192.168.1.95:5672'
  , comment = '请求用 算量 RabbitMQ 服务相关情报(OCCBOOL 算量用)
  设定格式: user:password@host:port'
;
INSERT INTO tbl_options
  SET code = '04DE1CCA-5A94-11E9-BC87-0242AC120004' -- 固定, 勿修正
  , value = 'CALC_OCCBOOL_DEVOPS_1010'
  , comment = '请求用 算量 RabbitMQ 队列名称(OCCBOOL 算量用)'
;
-- 回复用
INSERT INTO tbl_options
  SET code = '9123F970-5A95-11E9-BC87-0242AC120004' -- 固定, 勿修正
  , value = 'guest:guest@192.168.1.95:5672'
  , comment = '回复用 算量 RabbitMQ 服务相关情报(OCCBOOL 算量用)
 设定格式: user:password@host:port'
;
INSERT INTO tbl_options
  SET code = '991C9338-5A95-11E9-BC87-0242AC120004' -- 固定, 勿修正
  , value = 'CALC_OCCBOOL_DEVOPS_2010'
  , comment = '回复用 算量 RabbitMQ 队列名称(OCCBOOL 算量用)'
;

-- ############################################################################
-- OCCBOOL 算量用 工程情报
--   数据来源 hgdataserver.BIMMODEL.RecordID
-- ############################################################################
INSERT INTO tbl_options
  SET code = '946652CB-5B4F-11E9-BC87-0242AC120004' -- 固定, 勿修正
  , value = '2362|2352|2383'
  , comment = 'OCCBOOL 算量用 工程情报(OCCBOOL 算量用)
  数据来源参照 hgdataserver.BIMMODEL.RecordID
  设定格式: RecordID|RecordID|RecordID'
;

-- ############################################################################
-- OCCBOOL 算量用 计算构件类别情报
--   数据来源 hgdataserver.BIMMODEL.RecordID
-- ############################################################################
INSERT INTO tbl_options
  SET code = '07C829C3-5B6A-11E9-BC87-0242AC120004' -- 固定, 勿修正
  , value = '1|3|5|7'
  , comment = 'OCCBOOL 算量用 计算构件类别情报(OCCBOOL 算量用)
  数据来源参照 hg::bim::Category
  设定格式: Category|Category|Category'
;

-- ############################################################################
-- 待计算 OCCBOOL 算量队列为空, 等待耗时构件算量的完成或异常的超时处理情报
-- ############################################################################
INSERT INTO tbl_options
  SET code = '8C570A87-6021-11E9-BC87-0242AC120004' -- 固定, 勿修正
  , value = '30'
  , comment = '待计算 OCCBOOL 算量队列为空, 等待耗时构件算量的完成或异常的超时时间
  单位: 分钟
  设定范围(整型): [1, 60)'
;

-- ############################################################################
-- OCCBOOL 算量结果对比用的 公差 情报
-- ############################################################################
INSERT INTO tbl_options
  SET code = 'E521F9DE-60EA-11E9-BC87-0242AC120004' -- 固定, 勿修正
  , value = '0.005'
  , comment = '算量结果对比用的 公差 情报
  设定类型: 浮点型(设定参照 MySQL 关于 double(m, d) 定义)'
;

-- ############################################################################
-- OCCBOOL 算量用 同类型构件计算最大个数 情报
-- ############################################################################
INSERT INTO tbl_options
  SET code = '1D8AF05B-6748-11E9-BC87-0242AC120004' -- 固定, 勿修正
  , value = '100'
  , comment = '算量用 同类型构件计算最大个数 情报
  设定类型: 无符号型(0: 全计算)'
;

-- ############################################################################
-- END
-- ############################################################################
SELECT '  初始化 应用相关设定表(init_tbl_options)' AS '成功:';